using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Lab2
{
    public class Logics
    {
      public List<University> universities { get; set; }

        public void inizialaze()
        {
            universities = new List<University>();
            universities.Add(new University("ХНУРЭ", 10, 70, 130, new List<string> {"Афанасьева Анна Николаевна", "Бондарь Олег Владимирович", "Гречмак Дмитрий Викторович", "Григоров Артем Андреевич" }, new List<string> { "Ткачев Виталий Николаевич", "Кораблев Николай Михайлович", "Фомичев Александр Александрович", "Лукашов Сергей Андреевич" }));
            universities.Add(new University("ХНЭУ", 8, 50, 30, new List<string> { "Афанасьева Анна Николаевна", "Бондарь Олег Владимирович", "Гречмак Дмитрий Викторович", "Григоров Артем Андреевич" }, new List<string> { "Ткачев Виталий Николаевич", "Кораблев Николай Михайлович", "Фомичев Александр Александрович", "Лукашов Сергей Андреевич" }));
            universities.Add(new University("ХПИ", 15, 135, 135, new List<string> { "Афанасьева Анна Николаевна", "Бондарь Олег Владимирович", "Гречмак Дмитрий Викторович", "Григоров Артем Андреевич" }, new List<string> { "Ткачев Виталий Николаевич", "Кораблев Николай Михайлович", "Фомичев Александр Александрович", "Лукашов Сергей Андреевич" }));
            universities.Add(new University("ХНУ", 22, 12, 133, new List<string> { "Афанасьева Анна Николаевна", "Бондарь Олег Владимирович", "Гречмак Дмитрий Викторович", "Григоров Артем Андреевич" }, new List<string> { "Ткачев Виталий Николаевич", "Кораблев Николай Михайлович", "Фомичев Александр Александрович", "Лукашов Сергей Андреевич" }));
            universities.Add(new University("ХАИ", 7, 13, 10, new List<string> { "Афанасьева Анна Николаевна", "Бондарь Олег Владимирович", "Гречмак Дмитрий Викторович", "Григоров Артем Андреевич" }, new List<string> { "Ткачев Виталий Николаевич", "Кораблев Николай Михайлович", "Фомичев Александр Александрович", "Лукашов Сергей Андреевич" }));

        }



    }
}
